#вся инфа
literary_places = [
    {
        'name': 'Дом Родиона Раскольникова',
        'description': 'Существует мнение исследователей о том, что писатель Фёдор Достоевский, при написании романа "Преступление и наказание", мог вдохновляться Спасским переулком. Однако это мнение не было подтверждено. Литературоведы решили опираться на версию, предложенную вдовой Достоевского. Она утверждала, что комната Родиона Романовича находилась в Столярном переулке, в доме Шиля, где сам писатель снимал комнату в 1847-1849 годах. Каморка Раскольникова была на крыше пятиэтажного дома и напоминала больше шкаф, чем квартиру. Как и в романе, каморку можно было достичь по лестнице с 13 ступенями. В 1999 году на фасаде этого дома был установлен горельеф "Дом Раскольникова", но сам дом закрыт для посещения.',
        'latitude': 59.92774,
        'longitude': 30.311247,
        'photo': '/Users/a1234/Desktop/LTQ/core/imagesdomroscol.jpg'
    },
    {
        'name': 'Медный всадник',
        'description': '"Медный всадник" - памятник в Санкт-Петербурге, названный по стихотворению Пушкина. Он изображает Петра Великого на коне. В стихотворении Пушкин описывает чиновника, потерявшего возлюбленную в наводнении и винящего Петра за свои беды. Памятник оживает и преследует героя. Легенда гласит, что Петр пересек реку Неву на коне и хотел сделать это в третий раз, но неправильно произнес слова, и был превращен в камень. В балете, основанном на стихотворении Пушкина, есть гимн Санкт-Петербурга. "Медный всадник" расположен в центре города и символизирует его жизнь и процветание.',
        'latitude': 59.9364198,
        'longitude': 30.3021913,
        'photo': '/Users/a1234/Desktop/LTQ/core/imagesmedvsad.jpg'
    },
    {
        'name': 'Дом Пиковой дамы',
        'description': '"Дом Пиковой дамы" является символом мистической атмосферы, которая пронизывает литературные произведения Санкт-Петербурга. В этом здании сохранились архитектурные детали, которые помогают ощутить время и место, в котором развивается сюжет повести. Посещение "Дома Пиковой дамы" позволяет окунуться в мир загадок и страстей, оживить персонажей и почувствовать ту самую таинственность, которую описывал Пушкин. Это место является важной частью литературного наследия Санкт-Петербурга и вдохновляет посетителей на новые путешествия в мир слов и воображения.',
        'latitude':  59.935336,
        'longitude': 30.312652,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/pikdama.jpg'
    },
    {
        'name': 'Сенная площадь',
        'description': 'Сенная площадь в Санкт-Петербурге играет значимую роль не только в архитектуре и истории города, но и в литературе. В романе "Преступление и наказание" Федора Достоевского она становится местом, где разворачиваются события романа. Главный герой Раскольников прогуливается по площади, наблюдает за прохожими и внутренне борется со своими мыслями. В произведениях других писателей, таких как Андрей Белый, Иван Бунин и Александр Блок, тоже можно найти упоминания о Сенной площади, которая символизирует городскую суету и социальные противоречия.',
        'latitude':  59.926702,
        'longitude': 30.316479,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/senplosh.jpg'
    },
    {
        'name': 'Невский проспект',
        'description': 'Невский проспект в Санкт-Петербурге имеет большую литературную значимость. Он стал не только одной из главных улиц города, но и символом его духа и культуры. Многие писатели и поэты упоминали Невский проспект в своих произведениях, описывая его широту и многоликость.Эта историческая улица пронизана литературными образами и событиями. Здесь можно найти следы творчества Федора Достоевского, Александра Блока, Ивана Гончарова и многих других писателей.Невский проспект стал местом сборища и прогулок обитателей города, отражая жизнь и разнообразие Петербурга. Эта улица воплощает противоречия и притягательность городской суеты, а также служит фоном для развития сюжетов и создания образов.',
        'latitude': 59.932473,
        'longitude': 30.349169,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/nevprospect.jpg'
    },
    {
        'name': 'Михайловсий замок',
        'description': 'Михайловский замок в Санкт-Петербурге имеет значимое место в литературе. Этот исторический памятник являлся местом, связанным с жизнью и творчеством Александра Сергеевича Пушкина, одного из величайших русских поэтов.Михайловский замок служил музой для Пушкина, он проводил здесь много времени, писал стихи и прозу. Великолепный архитектурный облик замка и его историческая атмосфера вдохновляли поэта на создание произведений, отражающих русскую историю и культуру.Замок также является местом, где проходили встречи и общение литературных кругов, где Пушкин обменивался идеями и вдохновлялся другими писателями и поэтами своего времени.',
        'latitude': 59.940001,
        'longitude': 30.338067,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/mihzamok.jpg'
    },
    {
        'name': 'Летний сад',
        'description': "Летний сад в Санкт-Петербурге имеет особое значение в литературе. Этот прекрасный парк с его уникальной атмосферой и разнообразными растениями вдохновлял многих писателей и поэтов.Летний сад является местом, где литературные герои оживают и их истории оживают на фоне прекрасного природного окружения. В произведениях различных авторов Летний сад олицетворяет красоту, тайну и мистическую атмосферу.Он также служит местом, где писатели проводили свое время, наслаждаясь вдохновением и природной гармонией. Встречи, прогулки и размышления в Летнем саду стали частью жизни и творчества многих литераторов.Таким образом, Летний сад является символом литературной значимости и вдохновения, ставший источником великих произведений и вдохновением для многих писателей и поэтов. Этот парк продолжает притягивать любителей литературы и природы, которые наслаждаются его красотой и творческой атмосферой.",
        'latitude': 59.944722,
        'longitude': 30.335556,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/letsad.jpg'
    },
    {
        'name': 'Набережная реки Фонтанки',
        'description': 'Набережная реки Фонтанки в Санкт-Петербурге имеет большую литературную значимость. Это прекрасное место с протекающей рекой и историческими зданиями вдохновляло многих писателей и поэтов.Набережная Фонтанки является декором для множества литературных произведений, где она описывается во всей своей красоте и величии. Здесь можно прогуливаться вдоль реки, наслаждаться видом на исторические здания и ощущать атмосферу старого Петербурга.Многие известные литературные произведения, включая романы, стихи и рассказы, упоминают набережную Фонтанки как символ города и его культурного наследия. Она стала источником вдохновения для многих писателей, которые находили в ней идеальное место для творчества.Таким образом, набережная реки Фонтанки является важным элементом литературного наследия Санкт-Петербурга. Она продолжает привлекать любителей литературы и искусства, предлагая им возможность окунуться в атмосферу прошлого и насладиться красотой этого уникального места.',
        'latitude': 59.93056,
        'longitude': 30.33944,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/fontanka.jpg'
    },
    {
        'name': 'Книжная лавка писателей',
        'description': 'В конце XVIII века в Петербурге стали появляться книжные лавки. Смирдин считается самым лучшим книготорговцем – его лавка, находящаяся в церкви Петра и Павла на Невском проспекте, была одна из выдающихся – как по качеству изданий, так и дешевизне. Он издал множество произведений русских классиков, среди них были: Державин, Жуковский, Крылов, Карамзин, Пушкин, Ломоносов. В его лавке проходили встречи писателей, ученых, художников. Скорее всего, создание такого литературного салона натолкнуло на мысль о необходимости «Литературного фонда», который будет поддерживать литераторов. Он был создан в 1859 году, а в 1917 году закрыт, и возобновил свою работу лишь в 1934 году. Именно тогда была открыта «Книжная лавка писателей» на Невском проспекте, 66. Сейчас там можно приобрести книги, а также встретиться с современными литераторами, посетить тематические вечера, связанные с разнообразными историческими событиями России.',
        'latitude': 59.933658,
        'longitude': 30.342009,
        'photo': '/Users/a1234/Desktop/LTQ/core/images/bookshop.jpg'
    }
]
facts = [
    "Более 60 котов живет в Зимнем дворце. Говорят~ что они помогают там бороться с грызунами.",
    "Александровская колонна – высокий~ грузный и опасный монумент. А ее шаткая конструкция пугает многих туристов. Несмотря на то~ что она ничем не закреплена~ конструкция отстроена по всем законам физики. Ее вес и геометрическая форма вполне способны удержать ее в вертикальном положении.",
    "Знаменитого Чижика-Пыжика~ а точнее~ его скульптуру~ похищали семь раз.",
    "Первые фейерверки стали запускать в Петербурге в честь победы русского государства.",
    "Самый глубокий метрополитен в мире – Питерский. Ведь его глубина достигает 70-80 метров.",
    "Мариинский театр – самый известный в Санкт-Петербурге. Свое название получил от имени императрицы Марии Александровны – жены царя Александра II.",
    "В 1730 году жители города наблюдали необычное северное сияние.",
    "Пылающее золотое сердце с короной красовалось на эмблеме Петербурга до 1722 года.",
    "В Петербурге живет примерно в 2~5 меньше жителей~ чем в Москве.",
    "Высота Петропавловского собора – 122~5 метра. Это самый высокий собор в мире.",
    "Питер – город трамваев. Протяженность трамвайных путей достигает 600 километров.",
    "В горном музее Санкт-Петербурга находится самый большой малахит в мире. Его вес более 1500 кг.",
    "В современном Питере живет больше женщин~ чем мужчин.",
    "Санкт-Петербург занимает 5 место в топе самых шумных городов в мире.",
    "Чугунная голова лошади торчит из фасада дома~ расположенного по Коломенской улице.",
    "Питербурх~ Санкт-Петербург~ Петроград~ Ленинград и снова Санкт-Петербург – такое количество раз город успел сменить свое имя за годы существования.",
    "Вода занимает примерно 10% площади города. Это пруды~ реки~ озера.",
    "Исаакиевский собор полностью стоит на сваях.",
    "В 19 веке в Петербурге было запрещено курить. Эта мера была принята~ так как большинство домов были построены из дерева и могли легко загореться.",
    "На самом верху Адмиралтейского шпиля находится корабль весом более 65 кг~ покрытый золотом~ а под ним – шар~ в котором собрана коллекция золотых монет.",
    "В Санкт-Петербурге можно насчитать около 800 мостов.",
    "Петродворец настолько поражает своими фонтанами и каскадами~ что взят под охрану ЮНЕСКО. Для подачи воды не используются насосы~ и вода прибывает туда с Ропшинских высот естественным путем.",
    "Санкт-Петербург – город ангелов. Всего в городской скульптуре их насчитывается более 3000.",
    "Памятник Николаю I держится только на двух точках опоры.",
    "В Эрмитаже хранится более 3-х миллионов ценнейших экспонатов.",
    "На Невском проспекте обычно на 2-3 градуса теплее~ чем в других районах города. Ежедневно по нему проходит около 2 млн человек.",
    "Северная столица входит в топ 20 самых посещаемых туристами городов мира.",
    "В Санкт-Петербурге живет примерно столько же людей~ сколько во всей Дании.",
    "План строительства Петербурга разрабатывали лучшие известные мировые архитекторы.",
    "Сезон Белых ночей в Петербурге начинается 25 мая~ а самое светлое время наступает примерно в 20 числах июня."
]


intro = 'Добро пожаловать в литературный квест по Санкт-Петербургу!\n' \
        '\n' \
        'Как начать:\n' \
        '1. Нажмите кнопку "Начать квест", чтобы начать приключение.\n' \
        '2. Для успешного прохождения квеста необходимо правильно найти и посетить все литературные места в Санкт-Петербурге.\n' \
        '\n' \
        'Задачи:\n' \
        '1. Вам предстоит найти и посетить различные локации, которые связаны с литературой.\n' \
        '2. После того, как вы окажетесь в месте, нажмите "Я в нужной точке", чтобы перейти к следующему шагу.\n' \
        '\n' \
        'Интересные факты:\n' \
        '1. Вы также можете узнать интересные факты о Санкт-Петербурге. Просто нажмите кнопку "Факт", чтобы узнать случайный факт.\n' \
        '2. У вас есть всего 30 фактов, так что используйте их с умом!\n' \
        '\n' \
        'Удачи! Надеемся, что вы насладитесь квестом и узнаете много нового о литературных местах в этом удивительном городе. Если у вас есть вопросы или нужна помощь, не стесняйтесь обращаться @RS_Moder.\n' \
        'С уважением, Raptors Squad!'


end='Молодец! Вы завершили квест!\n'\
    '\n' \
    'Что вы успели сделать за сегодняшний день:\n' \
    '\n' \
    '1. Исследовали интересные литературные места в нашей северной столице\n' \
    '\n' \
    '2. Узнали 30 необычных фактов ,связанные с СПБ\n' \
    '\n' \
    '3.Потратили примерно 3 часа на это приключение \n' \
    '\n' \
    '4.Прошли около 13 км дороги и 2 лестницы\n' \
    '\n' \
    "В итоге надеюсь провели время с интересом)"
